1027066251-ops/DSP2837/F2837x_DefaultISR.c
//###########################################################################
//
// FILE:   F2837x_DefaultISR.c
//
// TITLE:  F2837x Device Default Interrupt Service Routines
//
//###########################################################################
// $TI Release: F2837xD Support Library v120 $
// $Release Date: Fri Aug 22 15:22:27 CDT 2014 $
//###########################################################################




//为 F2837xD MCU 提供默认中断服务程序，实现未定义中断的安全处理，并便于调试和用户替换。



/* 包含F2837xD器件主头文件，提供所有寄存器定义和基本器件宏定义 */
#include "F2837xD_Device.h"       // F2837x Header File Include File

/* 包含F2837xD示例头文件，提供示例代码相关的宏定义和函数原型 */
#include "F2837xD_Examples.h"     // F2837x Examples Include File

//---------------------------------------------------------------------------
// CPU Timer 1 Interrupt
/* 函数：TIMER1_ISR（CPU定时器1中断服务程序） */
interrupt void TIMER1_ISR(void)
{
    // Insert ISR Code here
    /* 在这里插入中断服务程序代码 */

    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    /* 以下两行仅用于调试，在此处暂停处理器 */
    /* 插入中断服务程序代码后移除 */
    asm ("      ESTOP0");
    for(;;);
}

// CPU Timer 2 Interrupt
/* 函数：TIMER2_ISR（CPU定时器2中断服务程序） */
interrupt void TIMER2_ISR(void)
{
    // Insert ISR Code here
    /* 在这里插入中断服务程序代码 */

    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    /* 以下两行仅用于调试，在此处暂停处理器 */
    /* 插入中断服务程序代码后移除 */
    asm ("      ESTOP0");
    for(;;);
}

// Datalogging Interrupt
/* 函数：DATALOG_ISR（数据记录中断服务程序） */
interrupt void DATALOG_ISR(void)
{
    // Insert ISR Code here
    /* 在这里插入中断服务程序代码 */

    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    /* 以下两行仅用于调试，在此处暂停处理器 */
    /* 插入中断服务程序代码后移除 */
    asm ("      ESTOP0");
    for(;;);
}

// RTOS Interrupt
/* 函数：RTOS_ISR（实时操作系统中断服务程序） */
interrupt void RTOS_ISR(void)
{
    // Insert ISR Code here
    /* 在这里插入中断服务程序代码 */

    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    /* 以下两行仅用于调试，在此处暂停处理器 */
    /* 插入中断服务程序代码后移除 */
    asm ("      ESTOP0");
    for(;;);
}

// Emulation Interrupt
/* 函数：EMU_ISR（仿真中断服务程序） */
interrupt void EMU_ISR(void)
{
    // Insert ISR Code here
    /* 在这里插入中断服务程序代码 */

    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    /* 以下两行仅用于调试，在此处暂停处理器 */
    /* 插入中断服务程序代码后移除 */
    asm ("      ESTOP0");
    for(;;);
}

// Non-Maskable Interrupt
/* 函数：NMI_ISR（非屏蔽中断服务程序） */
interrupt void NMI_ISR(void)
{
    // Insert ISR Code here
    /* 在这里插入中断服务程序代码 */

    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    /* 以下两行仅用于调试，在此处暂停处理器 */
    /* 插入中断服务程序代码后移除 */
    asm ("      ESTOP0");
    for(;;);
}

// Illegal Operation Trap
/* 函数：ILLEGAL_ISR（非法操作陷阱中断服务程序） */
interrupt void ILLEGAL_ISR(void)
{
    // Insert ISR Code here
    /* 在这里插入中断服务程序代码 */

    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    /* 以下两行仅用于调试，在此处暂停处理器 */
    /* 插入中断服务程序代码后移除 */
    asm ("      ESTOP0");
    for(;;);
}

// User Defined Trap 1
/* 函数：USER1_ISR（用户定义陷阱1中断服务程序） */
interrupt void USER1_ISR(void)
{
    // Insert ISR Code here
    /* 在这里插入中断服务程序代码 */

    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    /* 以下两行仅用于调试，在此处暂停处理器 */
    /* 插入中断服务程序代码后移除 */
    asm ("      ESTOP0");
    for(;;);
}

// User Defined Trap 2
/* 函数：USER2_ISR（用户定义陷阱2中断服务程序） */
interrupt void USER2_ISR(void)
{
    // Insert ISR Code here
    /* 在这里插入中断服务程序代码 */

    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    /* 以下两行仅用于调试，在此处暂停处理器 */
    /* 插入中断服务程序代码后移除 */
    asm ("      ESTOP0");
    for(;;);
}

// User Defined Trap 3
/* 函数：USER3_ISR（用户定义陷阱3中断服务程序） */
interrupt void USER3_ISR(void)
{
    // Insert ISR Code here
    /* 在这里插入中断服务程序代码 */

    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    /* 以下两行仅用于调试，在此处暂停处理器 */
    /* 插入中断服务程序代码后移除 */
    asm ("      ESTOP0");
    for(;;);
}

// User Defined Trap 4
/* 函数：USER4_ISR（用户定义陷阱4中断服务程序） */
interrupt void USER4_ISR(void)
{
    // Insert ISR Code here
    /* 在这里插入中断服务程序代码 */

    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    /* 以下两行仅用于调试，在此处暂停处理器 */
    /* 插入中断服务程序代码后移除 */
    asm ("      ESTOP0");
    for(;;);
}

// User Defined Trap 5
/* 函数：USER5_ISR（用户定义陷阱5中断服务程序） */
interrupt void USER5_ISR(void)
{
    // Insert ISR Code here
    /* 在这里插入中断服务程序代码 */

    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    /* 以下两行仅用于调试，在此处暂停处理器 */
    /* 插入中断服务程序代码后移除 */
    asm ("      ESTOP0");
    for(;;);
}

// User Defined Trap 6
/* 函数：USER6_ISR（用户定义陷阱6中断服务程序） */
interrupt void USER6_ISR(void)
{
    // Insert ISR Code here
    /* 在这里插入中断服务程序代码 */

    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    /* 以下两行仅用于调试，在此处暂停处理器 */
    /* 插入中断服务程序代码后移除 */
    asm ("      ESTOP0");
    for(;;);
}

// User Defined Trap 7
/* 函数：USER7_ISR（用户定义陷阱7中断服务程序） */
interrupt void USER7_ISR(void)
{
    // Insert ISR Code here
    /* 在这里插入中断服务程序代码 */

    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    /* 以下两行仅用于调试，在此处暂停处理器 */
    /* 插入中断服务程序代码后移除 */
    asm ("      ESTOP0");
    for(;;);
}

// User Defined Trap 8
/* 函数：USER8_ISR（用户定义陷阱8中断服务程序） */
interrupt void USER8_ISR(void)
{
    // Insert ISR Code here
    /* 在这里插入中断服务程序代码 */

    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    /* 以下两行仅用于调试，在此处暂停处理器 */
    /* 插入中断服务程序代码后移除 */
    asm ("      ESTOP0");
    for(;;);
}

// User Defined Trap 9
/* 函数：USER9_ISR（用户定义陷阱9中断服务程序） */
interrupt void USER9_ISR(void)
{
    // Insert ISR Code here
    /* 在这里插入中断服务程序代码 */

    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    /* 以下两行仅用于调试，在此处暂停处理器 */
    /* 插入中断服务程序代码后移除 */
    asm ("      ESTOP0");
    for(;;);
}

// User Defined Trap 10
/* 函数：USER10_ISR（用户定义陷阱10中断服务程序） */
interrupt void USER10_ISR(void)
{
    // Insert ISR Code here
    /* 在这里插入中断服务程序代码 */

    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    /* 以下两行仅用于调试，在此处暂停处理器 */
    /* 插入中断服务程序代码后移除 */
    asm ("      ESTOP0");
    for(;;);
}

// User Defined Trap 11
/* 函数：USER11_ISR（用户定义陷阱11中断服务程序） */
interrupt void USER11_ISR(void)
{
    // Insert ISR Code here
    /* 在这里插入中断服务程序代码 */

    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    /* 以下两行仅用于调试，在此处暂停处理器 */
    /* 插入中断服务程序代码后移除 */
    asm ("      ESTOP0");
    for(;;);
}

// User Defined Trap 12
/* 函数：USER12_ISR（用户定义陷阱12中断服务程序） */
interrupt void USER12_ISR(void)
{
    // Insert ISR Code here
    /* 在这里插入中断服务程序代码 */

    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    /* 以下两行仅用于调试，在此处暂停处理器 */
    /* 插入中断服务程序代码后移除 */
    asm ("      ESTOP0");
    for(;;);
}

// 1.1 - ADCA Interrupt 1
/* 函数：ADCA1_ISR（ADC A中断1服务程序） */
interrupt void ADCA1_ISR(void)
{
    // Insert ISR Code here
    /* 在这里插入中断服务程序代码 */

    // To receive more interrupts from this PIE group,
    // acknowledge this interrupt.
    /* 要从此PIE组接收更多中断，确认此中断 */
    // PieCtrlRegs.PIEACK.all = PIEACK_GROUP1;

    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    /* 以下两行仅用于调试，在此处暂停处理器 */
    /* 插入中断服务程序代码后移除 */
    asm ("      ESTOP0");
    for(;;);
}

// 1.2 - ADCB Interrupt 1
/* 函数：ADCB1_ISR（ADC B中断1服务程序） */
interrupt void ADCB1_ISR(void)
{
    // Insert ISR Code here
    /* 在这里插入中断服务程序代码 */

    // To receive more interrupts from this PIE group,
    // acknowledge this interrupt.
    /* 要从此PIE组接收更多中断，确认此中断 */
    // PieCtrlRegs.PIEACK.all = PIEACK_GROUP1;

    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    /* 以下两行仅用于调试，在此处暂停处理器 */
    /* 插入中断服务程序代码后移除 */
    asm ("      ESTOP0");
    for(;;);
}

// 1.3 - ADCC Interrupt 1
/* 函数：ADCC1_ISR（ADC C中断1服务程序） */
interrupt void ADCC1_ISR(void)
{
    // Insert ISR Code here
    /* 在这里插入中断服务程序代码 */

    // To receive more interrupts from this PIE group,
    // acknowledge this interrupt.
    /* 要从此PIE组接收更多中断，确认此中断 */
    // PieCtrlRegs.PIEACK.all = PIEACK_GROUP1;

    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    /* 以下两行仅用于调试，在此处暂停处理器 */
    /* 插入中断服务程序代码后移除 */
    asm ("      ESTOP0");
    for(;;);
}

// 1.4 - XINT1 Interrupt
/* 函数：XINT1_ISR（外部中断1服务程序） */
interrupt void XINT1_ISR(void)
{
    // Insert ISR Code here
    /* 在这里插入中断服务程序代码 */

    // To receive more interrupts from this PIE group,
    // acknowledge this interrupt.
    /* 要从此PIE组接收更多中断，确认此中断 */
    // PieCtrlRegs.PIEACK.all = PIEACK_GROUP1;

    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    /* 以下两行仅用于调试，在此处暂停处理器 */
    /* 插入中断服务程序代码后移除 */
    asm ("      ESTOP0");
    for(;;);
}

// 1.5 - XINT2 Interrupt
/* 函数：XINT2_ISR（外部中断2服务程序） */
interrupt void XINT2_ISR(void)
{
    // Insert ISR Code here
    /* 在这里插入中断服务程序代码 */

    // To receive more interrupts from this PIE group,
    // acknowledge this interrupt.
    /* 要从此PIE组接收更多中断，确认此中断 */
    // PieCtrlRegs.PIEACK.all = PIEACK_GROUP1;

    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    /* 以下两行仅用于调试，在此处暂停处理器 */
    /* 插入中断服务程序代码后移除 */
    asm ("      ESTOP0");
    for(;;);
}

// 1.6 - ADCD Interrupt 1
/* 函数：ADCD1_ISR（ADC D中断1服务程序） */
interrupt void ADCD1_ISR(void)
{
    // Insert ISR Code here
    /* 在这里插入中断服务程序代码 */

    // To receive more interrupts from this PIE group,
    // acknowledge this interrupt.
    /* 要从此PIE组接收更多中断，确认此中断 */
    // PieCtrlRegs.PIEACK.all = PIEACK_GROUP1;

    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    /* 以下两行仅用于调试，在此处暂停处理器 */
    /* 插入中断服务程序代码后移除 */
    asm ("      ESTOP0");
    for(;;);
}

