1027066251-ops/DSP2837/F2837x_DefaultISR.c
// 1.7 - Timer 0 Interrupt
/* 函数：TIMER0_ISR（定时器0中断服务程序） */
interrupt void TIMER0_ISR(void)
{
    // Insert ISR Code here
    /* 在这里插入中断服务程序代码 */

    // To receive more interrupts from this PIE group,
    // acknowledge this interrupt.
    /* 要从此PIE组接收更多中断，确认此中断 */
    // PieCtrlRegs.PIEACK.all = PIEACK_GROUP1;

    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    /* 以下两行仅用于调试，在此处暂停处理器 */
    /* 插入中断服务程序代码后移除 */
    asm ("      ESTOP0");
    for(;;);
}

// 1.8 - Standby and Halt Wakeup Interrupt
/* 函数：WAKE_ISR（待机和暂停唤醒中断服务程序） */
interrupt void WAKE_ISR(void)
{
    // Insert ISR Code here
    /* 在这里插入中断服务程序代码 */

    // To receive more interrupts from this PIE group,
    // acknowledge this interrupt.
    /* 要从此PIE组接收更多中断，确认此中断 */
    // PieCtrlRegs.PIEACK.all = PIEACK_GROUP1;

    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    /* 以下两行仅用于调试，在此处暂停处理器 */
    /* 插入中断服务程序代码后移除 */
    asm ("      ESTOP0");
    for(;;);
}

// 2.1 - ePWM1 Trip Zone Interrupt
/* 函数：EPWM1_TZ_ISR（增强型PWM1跳闸区中断服务程序） */
interrupt void EPWM1_TZ_ISR(void)
{
    // Insert ISR Code here
    /* 在这里插入中断服务程序代码 */

    // To receive more interrupts from this PIE group,
    // acknowledge this interrupt.
    /* 要从此PIE组接收更多中断，确认此中断 */
    // PieCtrlRegs.PIEACK.all = PIEACK_GROUP2;

    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    /* 以下两行仅用于调试，在此处暂停处理器 */
    /* 插入中断服务程序代码后移除 */
    asm ("      ESTOP0");
    for(;;);
}

// 2.2 - ePWM2 Trip Zone Interrupt
/* 函数：EPWM2_TZ_ISR（增强型PWM2跳闸区中断服务程序） */
interrupt void EPWM2_TZ_ISR(void)
{
    // Insert ISR Code here
    /* 在这里插入中断服务程序代码 */

    // To receive more interrupts from this PIE group,
    // acknowledge this interrupt.
    /* 要从此PIE组接收更多中断，确认此中断 */
    // PieCtrlRegs.PIEACK.all = PIEACK_GROUP2;

    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    /* 以下两行仅用于调试，在此处暂停处理器 */
    /* 插入中断服务程序代码后移除 */
    asm ("      ESTOP0");
    for(;;);
}

// 2.3 - ePWM3 Trip Zone Interrupt
/* 函数：EPWM3_TZ_ISR（增强型PWM3跳闸区中断服务程序） */
interrupt void EPWM3_TZ_ISR(void)
{
    // Insert ISR Code here
    /* 在这里插入中断服务程序代码 */

    // To receive more interrupts from this PIE group,
    // acknowledge this interrupt.
    /* 要从此PIE组接收更多中断，确认此中断 */
    // PieCtrlRegs.PIEACK.all = PIEACK_GROUP2;

    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    /* 以下两行仅用于调试，在此处暂停处理器 */
    /* 插入中断服务程序代码后移除 */
    asm ("      ESTOP0");
    for(;;);
}

// 2.4 - ePWM4 Trip Zone Interrupt
/* 函数：EPWM4_TZ_ISR（增强型PWM4跳闸区中断服务程序） */
interrupt void EPWM4_TZ_ISR(void)
{
    // Insert ISR Code here
    /* 在这里插入中断服务程序代码 */

    // To receive more interrupts from this PIE group,
    // acknowledge this interrupt.
    /* 要从此PIE组接收更多中断，确认此中断 */
    // PieCtrlRegs.PIEACK.all = PIEACK_GROUP2;

    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    /* 以下两行仅用于调试，在此处暂停处理器 */
    /* 插入中断服务程序代码后移除 */
    asm ("      ESTOP0");
    for(;;);
}

// 2.5 - ePWM5 Trip Zone Interrupt
/* 函数：EPWM5_TZ_ISR（增强型PWM5跳闸区中断服务程序） */
interrupt void EPWM5_TZ_ISR(void)
{
    // Insert ISR Code here
    /* 在这里插入中断服务程序代码 */

    // To receive more interrupts from this PIE group,
    // acknowledge this interrupt.
    /* 要从此PIE组接收更多中断，确认此中断 */
    // PieCtrlRegs.PIEACK.all = PIEACK_GROUP2;

    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    /* 以下两行仅用于调试，在此处暂停处理器 */
    /* 插入中断服务程序代码后移除 */
    asm ("      ESTOP0");
    for(;;);
}

// 2.6 - ePWM6 Trip Zone Interrupt
/* 函数：EPWM6_TZ_ISR（增强型PWM6跳闸区中断服务程序） */
interrupt void EPWM6_TZ_ISR(void)
{
    // Insert ISR Code here
    /* 在这里插入中断服务程序代码 */

    // To receive more interrupts from this PIE group,
    // acknowledge this interrupt.
    /* 要从此PIE组接收更多中断，确认此中断 */
    // PieCtrlRegs.PIEACK.all = PIEACK_GROUP2;

    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    /* 以下两行仅用于调试，在此处暂停处理器 */
    /* 插入中断服务程序代码后移除 */
    asm ("      ESTOP0");
    for(;;);
}

// 2.7 - ePWM7 Trip Zone Interrupt
/* 函数：EPWM7_TZ_ISR（增强型PWM7跳闸区中断服务程序） */
interrupt void EPWM7_TZ_ISR(void)
{
    // Insert ISR Code here
    /* 在这里插入中断服务程序代码 */

    // To receive more interrupts from this PIE group,
    // acknowledge this interrupt.
    /* 要从此PIE组接收更多中断，确认此中断 */
    // PieCtrlRegs.PIEACK.all = PIEACK_GROUP2;

    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    /* 以下两行仅用于调试，在此处暂停处理器 */
    /* 插入中断服务程序代码后移除 */
    asm ("      ESTOP0");
    for(;;);
}

// 2.8 - ePWM8 Trip Zone Interrupt
/* 函数：EPWM8_TZ_ISR（增强型PWM8跳闸区中断服务程序） */
interrupt void EPWM8_TZ_ISR(void)
{
    // Insert ISR Code here
    /* 在这里插入中断服务程序代码 */

    // To receive more interrupts from this PIE group,
    // acknowledge this interrupt.
    /* 要从此PIE组接收更多中断，确认此中断 */
    // PieCtrlRegs.PIEACK.all = PIEACK_GROUP2;

    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    /* 以下两行仅用于调试，在此处暂停处理器 */
    /* 插入中断服务程序代码后移除 */
    asm ("      ESTOP0");
    for(;;);
}

// 3.1 - ePWM1 Interrupt
/* 函数：EPWM1_ISR（增强型PWM1中断服务程序） */
interrupt void EPWM1_ISR(void)
{
    // Insert ISR Code here
    /* 在这里插入中断服务程序代码 */

    // To receive more interrupts from this PIE group,
    // acknowledge this interrupt.
    /* 要从此PIE组接收更多中断，确认此中断 */
    // PieCtrlRegs.PIEACK.all = PIEACK_GROUP3;

    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    /* 以下两行仅用于调试，在此处暂停处理器 */
    /* 插入中断服务程序代码后移除 */
    asm ("      ESTOP0");
    for(;;);
}

// 3.2 - ePWM2 Interrupt
/* 函数：EPWM2_ISR（增强型PWM2中断服务程序） */
interrupt void EPWM2_ISR(void)
{
    // Insert ISR Code here
    /* 在这里插入中断服务程序代码 */

    // To receive more interrupts from this PIE group,
    // acknowledge this interrupt.
    /* 要从此PIE组接收更多中断，确认此中断 */
    // PieCtrlRegs.PIEACK.all = PIEACK_GROUP3;

    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    /* 以下两行仅用于调试，在此处暂停处理器 */
    /* 插入中断服务程序代码后移除 */
    asm ("      ESTOP0");
    for(;;);
}

// 3.3 - ePWM3 Interrupt
/* 函数：EPWM3_ISR（增强型PWM3中断服务程序） */
interrupt void EPWM3_ISR(void)
{
    // Insert ISR Code here
    /* 在这里插入中断服务程序代码 */

    // To receive more interrupts from this PIE group,
    // acknowledge this interrupt.
    /* 要从此PIE组接收更多中断，确认此中断 */
    // PieCtrlRegs.PIEACK.all = PIEACK_GROUP3;

    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    /* 以下两行仅用于调试，在此处暂停处理器 */
    /* 插入中断服务程序代码后移除 */
    asm ("      ESTOP0");
    for(;;);
}

// 3.4 - ePWM4 Interrupt
/* 函数：EPWM4_ISR（增强型PWM4中断服务程序） */
interrupt void EPWM4_ISR(void)
{
    // Insert ISR Code here
    /* 在这里插入中断服务程序代码 */

    // To receive more interrupts from this PIE group,
    // acknowledge this interrupt.
    /* 要从此PIE组接收更多中断，确认此中断 */
    // PieCtrlRegs.PIEACK.all = PIEACK_GROUP3;

    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    /* 以下两行仅用于调试，在此处暂停处理器 */
    /* 插入中断服务程序代码后移除 */
    asm ("      ESTOP0");
    for(;;);
}

// 3.5 - ePWM5 Interrupt
/* 函数：EPWM5_ISR（增强型PWM5中断服务程序） */
interrupt void EPWM5_ISR(void)
{
    // Insert ISR Code here
    /* 在这里插入中断服务程序代码 */

    // To receive more interrupts from this PIE group,
    // acknowledge this interrupt.
    /* 要从此PIE组接收更多中断，确认此中断 */
    // PieCtrlRegs.PIEACK.all = PIEACK_GROUP3;

    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    /* 以下两行仅用于调试，在此处暂停处理器 */
    /* 插入中断服务程序代码后移除 */
    asm ("      ESTOP0");
    for(;;);
}

// 3.6 - ePWM6 Interrupt
/* 函数：EPWM6_ISR（增强型PWM6中断服务程序） */
interrupt void EPWM6_ISR(void)
{
    // Insert ISR Code here
    /* 在这里插入中断服务程序代码 */

    // To receive more interrupts from this PIE group,
    // acknowledge this interrupt.
    /* 要从此PIE组接收更多中断，确认此中断 */
    // PieCtrlRegs.PIEACK.all = PIEACK_GROUP3;

    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    /* 以下两行仅用于调试，在此处暂停处理器 */
    /* 插入中断服务程序代码后移除 */
    asm ("      ESTOP0");
    for(;;);
}

// 3.7 - ePWM7 Interrupt
/* 函数：EPWM7_ISR（增强型PWM7中断服务程序） */
interrupt void EPWM7_ISR(void)
{
    // Insert ISR Code here
    /* 在这里插入中断服务程序代码 */

    // To receive more interrupts from this PIE group,
    // acknowledge this interrupt.
    /* 要从此PIE组接收更多中断，确认此中断 */
    // PieCtrlRegs.PIEACK.all = PIEACK_GROUP3;

    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    /* 以下两行仅用于调试，在此处暂停处理器 */
    /* 插入中断服务程序代码后移除 */
    asm ("      ESTOP0");
    for(;;);
}

// 3.8 - ePWM8 Interrupt
/* 函数：EPWM8_ISR（增强型PWM8中断服务程序） */
interrupt void EPWM8_ISR(void)
{
    // Insert ISR Code here
    /* 在这里插入中断服务程序代码 */

    // To receive more interrupts from this PIE group,
    // acknowledge this interrupt.
    /* 要从此PIE组接收更多中断，确认此中断 */
    // PieCtrlRegs.PIEACK.all = PIEACK_GROUP3;

    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    /* 以下两行仅用于调试，在此处暂停处理器 */
    /* 插入中断服务程序代码后移除 */
    asm ("      ESTOP0");
    for(;;);
}

