1027066251-ops/DSP2837/F2837x_DefaultISR.c
// 9.4 - SCIB Transmit Interrupt
/* 函数：SCIB_TX_ISR（SCI B发送中断服务程序） */
interrupt void SCIB_TX_ISR(void)
{
    // Insert ISR Code here
    /* 在这里插入中断服务程序代码 */

    // To receive more interrupts from this PIE group,
    // acknowledge this interrupt.
    /* 要从此PIE组接收更多中断，确认此中断 */
    // PieCtrlRegs.PIEACK.all = PIEACK_GROUP9;

    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    /* 以下两行仅用于调试，在此处暂停处理器 */
    /* 插入中断服务程序代码后移除 */
    asm ("      ESTOP0");
    for(;;);
}

// 9.5 - DCANA Interrupt 1
/* 函数：DCANA_1_ISR（CAN A中断1服务程序） */
interrupt void DCANA_1_ISR(void)
{
    // Insert ISR Code here
    /* 在这里插入中断服务程序代码 */

    // To receive more interrupts from this PIE group,
    // acknowledge this interrupt.
    /* 要从此PIE组接收更多中断，确认此中断 */
    // PieCtrlRegs.PIEACK.all = PIEACK_GROUP9;

    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    /* 以下两行仅用于调试，在此处暂停处理器 */
    /* 插入中断服务程序代码后移除 */
    asm ("      ESTOP0");
    for(;;);
}

// 9.6 - DCANA Interrupt 2
/* 函数：DCANA_2_ISR（CAN A中断2服务程序） */
interrupt void DCANA_2_ISR(void)
{
    // Insert ISR Code here
    /* 在这里插入中断服务程序代码 */

    // To receive more interrupts from this PIE group,
    // acknowledge this interrupt.
    /* 要从此PIE组接收更多中断，确认此中断 */
    // PieCtrlRegs.PIEACK.all = PIEACK_GROUP9;

    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    /* 以下两行仅用于调试，在此处暂停处理器 */
    /* 插入中断服务程序代码后移除 */
    asm ("      ESTOP0");
    for(;;);
}

// 9.7 - DCANB Interrupt 1
/* 函数：DCANB_1_ISR（CAN B中断1服务程序） */
interrupt void DCANB_1_ISR(void)
{
    // Insert ISR Code here
    /* 在这里插入中断服务程序代码 */

    // To receive more interrupts from this PIE group,
    // acknowledge this interrupt.
    /* 要从此PIE组接收更多中断，确认此中断 */
    // PieCtrlRegs.PIEACK.all = PIEACK_GROUP9;

    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    /* 以下两行仅用于调试，在此处暂停处理器 */
    /* 插入中断服务程序代码后移除 */
    asm ("      ESTOP0");
    for(;;);
}

// 9.8 - DCANB Interrupt 2
/* 函数：DCANB_2_ISR（CAN B中断2服务程序） */
interrupt void DCANB_2_ISR(void)
{
    // Insert ISR Code here
    /* 在这里插入中断服务程序代码 */

    // To receive more interrupts from this PIE group,
    // acknowledge this interrupt.
    /* 要从此PIE组接收更多中断，确认此中断 */
    // PieCtrlRegs.PIEACK.all = PIEACK_GROUP9;

    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    /* 以下两行仅用于调试，在此处暂停处理器 */
    /* 插入中断服务程序代码后移除 */
    asm ("      ESTOP0");
    for(;;);
}

// 10.1 - ADCA Event Interrupt
/* 函数：ADCA_EVT_ISR（ADC A事件中断服务程序） */
interrupt void ADCA_EVT_ISR(void)
{
    // Insert ISR Code here
    /* 在这里插入中断服务程序代码 */

    // To receive more interrupts from this PIE group,
    // acknowledge this interrupt.
    /* 要从此PIE组接收更多中断，确认此中断 */
    // PieCtrlRegs.PIEACK.all = PIEACK_GROUP10;

    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    /* 以下两行仅用于调试，在此处暂停处理器 */
    /* 插入中断服务程序代码后移除 */
    asm ("      ESTOP0");
    for(;;);
}

// 10.2 - ADCA Interrupt 2
/* 函数：ADCA2_ISR（ADC A中断2服务程序） */
interrupt void ADCA2_ISR(void)
{
    // Insert ISR Code here
    /* 在这里插入中断服务程序代码 */

    // To receive more interrupts from this PIE group,
    // acknowledge this interrupt.
    /* 要从此PIE组接收更多中断，确认此中断 */
    // PieCtrlRegs.PIEACK.all = PIEACK_GROUP10;

    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    /* 以下两行仅用于调试，在此处暂停处理器 */
    /* 插入中断服务程序代码后移除 */
    asm ("      ESTOP0");
    for(;;);
}

// 10.3 - ADCA Interrupt 3
/* 函数：ADCA3_ISR（ADC A中断3服务程序） */
interrupt void ADCA3_ISR(void)
{
    // Insert ISR Code here
    /* 在这里插入中断服务程序代码 */

    // To receive more interrupts from this PIE group,
    // acknowledge this interrupt.
    /* 要从此PIE组接收更多中断，确认此中断 */
    // PieCtrlRegs.PIEACK.all = PIEACK_GROUP10;

    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    /* 以下两行仅用于调试，在此处暂停处理器 */
    /* 插入中断服务程序代码后移除 */
    asm ("      ESTOP0");
    for(;;);
}

// 10.4 - ADCA Interrupt 4
/* 函数：ADCA4_ISR（ADC A中断4服务程序） */
interrupt void ADCA4_ISR(void)
{
    // Insert ISR Code here
    /* 在这里插入中断服务程序代码 */

    // To receive more interrupts from this PIE group,
    // acknowledge this interrupt.
    /* 要从此PIE组接收更多中断，确认此中断 */
    // PieCtrlRegs.PIEACK.all = PIEACK_GROUP10;

    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    /* 以下两行仅用于调试，在此处暂停处理器 */
    /* 插入中断服务程序代码后移除 */
    asm ("      ESTOP0");
    for(;;);
}

// 10.5 - ADCB Event Interrupt
/* 函数：ADCB_EVT_ISR（ADC B事件中断服务程序） */
interrupt void ADCB_EVT_ISR(void)
{
    // Insert ISR Code here
    /* 在这里插入中断服务程序代码 */

    // To receive more interrupts from this PIE group,
    // acknowledge this interrupt.
    /* 要从此PIE组接收更多中断，确认此中断 */
    // PieCtrlRegs.PIEACK.all = PIEACK_GROUP10;

    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    /* 以下两行仅用于调试，在此处暂停处理器 */
    /* 插入中断服务程序代码后移除 */
    asm ("      ESTOP0");
    for(;;);
}

// 10.6 - ADCB Interrupt 2
/* 函数：ADCB2_ISR（ADC B中断2服务程序） */
interrupt void ADCB2_ISR(void)
{
    // Insert ISR Code here
    /* 在这里插入中断服务程序代码 */

    // To receive more interrupts from this PIE group,
    // acknowledge this interrupt.
    /* 要从此PIE组接收更多中断，确认此中断 */
    // PieCtrlRegs.PIEACK.all = PIEACK_GROUP10;

    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    /* 以下两行仅用于调试，在此处暂停处理器 */
    /* 插入中断服务程序代码后移除 */
    asm ("      ESTOP0");
    for(;;);
}

// 10.7 - ADCB Interrupt 3
/* 函数：ADCB3_ISR（ADC B中断3服务程序） */
interrupt void ADCB3_ISR(void)
{
    // Insert ISR Code here
    /* 在这里插入中断服务程序代码 */

    // To receive more interrupts from this PIE group,
    // acknowledge this interrupt.
    /* 要从此PIE组接收更多中断，确认此中断 */
    // PieCtrlRegs.PIEACK.all = PIEACK_GROUP10;

    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    /* 以下两行仅用于调试，在此处暂停处理器 */
    /* 插入中断服务程序代码后移除 */
    asm ("      ESTOP0");
    for(;;);
}

// 10.8 - ADCB Interrupt 4
/* 函数：ADCB4_ISR（ADC B中断4服务程序） */
interrupt void ADCB4_ISR(void)
{
    // Insert ISR Code here
    /* 在这里插入中断服务程序代码 */

    // To receive more interrupts from this PIE group,
    // acknowledge this interrupt.
    /* 要从此PIE组接收更多中断，确认此中断 */
    // PieCtrlRegs.PIEACK.all = PIEACK_GROUP10;

    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    /* 以下两行仅用于调试，在此处暂停处理器 */
    /* 插入中断服务程序代码后移除 */
    asm ("      ESTOP0");
    for(;;);
}

// 11.1 - CLA1 Interrupt 1
/* 函数：CLA1_1_ISR（控制律加速器1中断1服务程序） */
interrupt void CLA1_1_ISR(void)
{
    // Insert ISR Code here
    /* 在这里插入中断服务程序代码 */

    // To receive more interrupts from this PIE group,
    // acknowledge this interrupt.
    /* 要从此PIE组接收更多中断，确认此中断 */
    // PieCtrlRegs.PIEACK.all = PIEACK_GROUP11;

    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    /* 以下两行仅用于调试，在此处暂停处理器 */
    /* 插入中断服务程序代码后移除 */
    asm ("      ESTOP0");
    for(;;);
}

// 11.2 - CLA1 Interrupt 2
/* 函数：CLA1_2_ISR（控制律加速器1中断2服务程序） */
interrupt void CLA1_2_ISR(void)
{
    // Insert ISR Code here
    /* 在这里插入中断服务程序代码 */

    // To receive more interrupts from this PIE group,
    // acknowledge this interrupt.
    /* 要从此PIE组接收更多中断，确认此中断 */
    // PieCtrlRegs.PIEACK.all = PIEACK_GROUP11;

    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    /* 以下两行仅用于调试，在此处暂停处理器 */
    /* 插入中断服务程序代码后移除 */
    asm ("      ESTOP0");
    for(;;);
}

// 11.3 - CLA1 Interrupt 3
/* 函数：CLA1_3_ISR（控制律加速器1中断3服务程序） */
interrupt void CLA1_3_ISR(void)
{
    // Insert ISR Code here
    /* 在这里插入中断服务程序代码 */

    // To receive more interrupts from this PIE group,
    // acknowledge this interrupt.
    /* 要从此PIE组接收更多中断，确认此中断 */
    // PieCtrlRegs.PIEACK.all = PIEACK_GROUP11;

    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    /* 以下两行仅用于调试，在此处暂停处理器 */
    /* 插入中断服务程序代码后移除 */
    asm ("      ESTOP0");
    for(;;);
}

// 11.4 - CLA1 Interrupt 4
/* 函数：CLA1_4_ISR（控制律加速器1中断4服务程序） */
interrupt void CLA1_4_ISR(void)
{
    // Insert ISR Code here
    /* 在这里插入中断服务程序代码 */

    // To receive more interrupts from this PIE group,
    // acknowledge this interrupt.
    /* 要从此PIE组接收更多中断，确认此中断 */
    // PieCtrlRegs.PIEACK.all = PIEACK_GROUP11;

    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    /* 以下两行仅用于调试，在此处暂停处理器 */
    /* 插入中断服务程序代码后移除 */
    asm ("      ESTOP0");
    for(;;);
}

// 11.5 - CLA1 Interrupt 5
/* 函数：CLA1_5_ISR（控制律加速器1中断5服务程序） */
interrupt void CLA1_5_ISR(void)
{
    // Insert ISR Code here
    /* 在这里插入中断服务程序代码 */

    // To receive more interrupts from this PIE group,
    // acknowledge this interrupt.
    /* 要从此PIE组接收更多中断，确认此中断 */
    // PieCtrlRegs.PIEACK.all = PIEACK_GROUP11;

    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    /* 以下两行仅用于调试，在此处暂停处理器 */
    /* 插入中断服务程序代码后移除 */
    asm ("      ESTOP0");
    for(;;);
}

// 11.6 - CLA1 Interrupt 6
/* 函数：CLA1_6_ISR（控制律加速器1中断6服务程序） */
interrupt void CLA1_6_ISR(void)
{
    // Insert ISR Code here
    /* 在这里插入中断服务程序代码 */

    // To receive more interrupts from this PIE group,
    // acknowledge this interrupt.
    /* 要从此PIE组接收更多中断，确认此中断 */
    // PieCtrlRegs.PIEACK.all = PIEACK_GROUP11;

    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    /* 以下两行仅用于调试，在此处暂停处理器 */
    /* 插入中断服务程序代码后移除 */
    asm ("      ESTOP0");
    for(;;);
}

// 11.7 - CLA1 Interrupt 7
/* 函数：CLA1_7_ISR（控制律加速器1中断7服务程序） */
interrupt void CLA1_7_ISR(void)
{
    // Insert ISR Code here
    /* 在这里插入中断服务程序代码 */

    // To receive more interrupts from this PIE group,
    // acknowledge this interrupt.
    /* 要从此PIE组接收更多中断，确认此中断 */
    // PieCtrlRegs.PIEACK.all = PIEACK_GROUP11;

    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    /* 以下两行仅用于调试，在此处暂停处理器 */
    /* 插入中断服务程序代码后移除 */
    asm ("      ESTOP0");
    for(;;);
}

// 11.8 - CLA1 Interrupt 8
/* 函数：CLA1_8_ISR（控制律加速器1中断8服务程序） */
interrupt void CLA1_8_ISR(void)
{
    // Insert ISR Code here
    /* 在这里插入中断服务程序代码 */

    // To receive more interrupts from this PIE group,
    // acknowledge this interrupt.
    /* 要从此PIE组接收更多中断，确认此中断 */
    // PieCtrlRegs.PIEACK.all = PIEACK_GROUP11;

    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    /* 以下两行仅用于调试，在此处暂停处理器 */
    /* 插入中断服务程序代码后移除 */
    asm ("      ESTOP0");
    for(;;);
}

// 12.1 - XINT3 Interrupt
/* 函数：XINT3_ISR（外部中断3服务程序） */
interrupt void XINT3_ISR(void)
{
    // Insert ISR Code here
    /* 在这里插入中断服务程序代码 */

    // To receive more interrupts from this PIE group,
    // acknowledge this interrupt.
    /* 要从此PIE组接收更多中断，确认此中断 */
    // PieCtrlRegs.PIEACK.all = PIEACK_GROUP12;

    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    /* 以下两行仅用于调试，在此处暂停处理器 */
    /* 插入中断服务程序代码后移除 */
    asm ("      ESTOP0");
    for(;;);
}

