1027066251-ops/DSP2837/F2837x_DefaultISR.c
// 10.10 - ADCC Interrupt 2
/* 函数：ADCC2_ISR（ADC C中断2服务程序） */
interrupt void ADCC2_ISR(void)
{
    // Insert ISR Code here
    /* 在这里插入中断服务程序代码 */

    // To receive more interrupts from this PIE group,
    // acknowledge this interrupt.
    /* 要从此PIE组接收更多中断，确认此中断 */
    // PieCtrlRegs.PIEACK.all = PIEACK_GROUP10;

    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    /* 以下两行仅用于调试，在此处暂停处理器 */
    /* 插入中断服务程序代码后移除 */
    asm ("      ESTOP0");
    for(;;);
}

// 10.11 - ADCC Interrupt 3
/* 函数：ADCC3_ISR（ADC C中断3服务程序） */
interrupt void ADCC3_ISR(void)
{
    // Insert ISR Code here
    /* 在这里插入中断服务程序代码 */

    // To receive more interrupts from this PIE group,
    // acknowledge this interrupt.
    /* 要从此PIE组接收更多中断，确认此中断 */
    // PieCtrlRegs.PIEACK.all = PIEACK_GROUP10;

    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    /* 以下两行仅用于调试，在此处暂停处理器 */
    /* 插入中断服务程序代码后移除 */
    asm ("      ESTOP0");
    for(;;);
}

// 10.12 - ADCC Interrupt 4
/* 函数：ADCC4_ISR（ADC C中断4服务程序） */
interrupt void ADCC4_ISR(void)
{
    // Insert ISR Code here
    /* 在这里插入中断服务程序代码 */

    // To receive more interrupts from this PIE group,
    // acknowledge this interrupt.
    /* 要从此PIE组接收更多中断，确认此中断 */
    // PieCtrlRegs.PIEACK.all = PIEACK_GROUP10;

    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    /* 以下两行仅用于调试，在此处暂停处理器 */
    /* 插入中断服务程序代码后移除 */
    asm ("      ESTOP0");
    for(;;);
}

// 10.13 - ADCD Event Interrupt
/* 函数：ADCD_EVT_ISR（ADC D事件中断服务程序） */
interrupt void ADCD_EVT_ISR(void)
{
    // Insert ISR Code here
    /* 在这里插入中断服务程序代码 */

    // To receive more interrupts from this PIE group,
    // acknowledge this interrupt.
    /* 要从此PIE组接收更多中断，确认此中断 */
    // PieCtrlRegs.PIEACK.all = PIEACK_GROUP10;

    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    /* 以下两行仅用于调试，在此处暂停处理器 */
    /* 插入中断服务程序代码后移除 */
    asm ("      ESTOP0");
    for(;;);
}

// 10.14 - ADCD Interrupt 2
/* 函数：ADCD2_ISR（ADC D中断2服务程序） */
interrupt void ADCD2_ISR(void)
{
    // Insert ISR Code here
    /* 在这里插入中断服务程序代码 */

    // To receive more interrupts from this PIE group,
    // acknowledge this interrupt.
    /* 要从此PIE组接收更多中断，确认此中断 */
    // PieCtrlRegs.PIEACK.all = PIEACK_GROUP10;

    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    /* 以下两行仅用于调试，在此处暂停处理器 */
    /* 插入中断服务程序代码后移除 */
    asm ("      ESTOP0");
    for(;;);
}

// 10.15 - ADCD Interrupt 3
/* 函数：ADCD3_ISR（ADC D中断3服务程序） */
interrupt void ADCD3_ISR(void)
{
    // Insert ISR Code here
    /* 在这里插入中断服务程序代码 */

    // To receive more interrupts from this PIE group,
    // acknowledge this interrupt.
    /* 要从此PIE组接收更多中断，确认此中断 */
    // PieCtrlRegs.PIEACK.all = PIEACK_GROUP10;

    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    /* 以下两行仅用于调试，在此处暂停处理器 */
    /* 插入中断服务程序代码后移除 */
    asm ("      ESTOP0");
    for(;;);
}

// 10.16 - ADCD Interrupt 4
/* 函数：ADCD4_ISR（ADC D中断4服务程序） */
interrupt void ADCD4_ISR(void)
{
    // Insert ISR Code here
    /* 在这里插入中断服务程序代码 */

    // To receive more interrupts from this PIE group,
    // acknowledge this interrupt.
    /* 要从此PIE组接收更多中断，确认此中断 */
    // PieCtrlRegs.PIEACK.all = PIEACK_GROUP10;

    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    /* 以下两行仅用于调试，在此处暂停处理器 */
    /* 插入中断服务程序代码后移除 */
    asm ("      ESTOP0");
    for(;;);
}

// 12.9 - EMIF Error Interrupt
/* 函数：EMIF_ERROR_ISR（外部存储器接口错误中断服务程序） */
interrupt void EMIF_ERROR_ISR(void)
{
    // Insert ISR Code here
    /* 在这里插入中断服务程序代码 */

    // To receive more interrupts from this PIE group,
    // acknowledge this interrupt.
    /* 要从此PIE组接收更多中断，确认此中断 */
    // PieCtrlRegs.PIEACK.all = PIEACK_GROUP12;

    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    /* 以下两行仅用于调试，在此处暂停处理器 */
    /* 插入中断服务程序代码后移除 */
    asm ("      ESTOP0");
    for(;;);
}

// 12.10 - RAM Correctable Error Interrupt
/* 函数：RAM_CORRECTABLE_ERROR_ISR（RAM可纠正错误中断服务程序） */
interrupt void RAM_CORRECTABLE_ERROR_ISR(void)
{
    // Insert ISR Code here
    /* 在这里插入中断服务程序代码 */

    // To receive more interrupts from this PIE group,
    // acknowledge this interrupt.
    /* 要从此PIE组接收更多中断，确认此中断 */
    // PieCtrlRegs.PIEACK.all = PIEACK_GROUP12;

    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    /* 以下两行仅用于调试，在此处暂停处理器 */
    /* 插入中断服务程序代码后移除 */
    asm ("      ESTOP0");
    for(;;);
}

// 12.11 - Flash Correctable Error Interrupt
/* 函数：FLASH_CORRECTABLE_ERROR_ISR（闪存可纠正错误中断服务程序） */
interrupt void FLASH_CORRECTABLE_ERROR_ISR(void)
{
    // Insert ISR Code here
    /* 在这里插入中断服务程序代码 */

    // To receive more interrupts from this PIE group,
    // acknowledge this interrupt.
    /* 要从此PIE组接收更多中断，确认此中断 */
    // PieCtrlRegs.PIEACK.all = PIEACK_GROUP12;

    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    /* 以下两行仅用于调试，在此处暂停处理器 */
    /* 插入中断服务程序代码后移除 */
    asm ("      ESTOP0");
    for(;;);
}

// 12.12 - RAM Access Violation Interrupt
/* 函数：RAM_ACCESS_VIOLATION_ISR（RAM访问违规中断服务程序） */
interrupt void RAM_ACCESS_VIOLATION_ISR(void)
{
    // Insert ISR Code here
    /* 在这里插入中断服务程序代码 */

    // To receive more interrupts from this PIE group,
    // acknowledge this interrupt.
    /* 要从此PIE组接收更多中断，确认此中断 */
    // PieCtrlRegs.PIEACK.all = PIEACK_GROUP12;

    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    /* 以下两行仅用于调试，在此处暂停处理器 */
    /* 插入中断服务程序代码后移除 */
    asm ("      ESTOP0");
    for(;;);
}

// 12.13 - System PLL Slip Interrupt
/* 函数：SYS_PLL_SLIP_ISR（系统PLL滑移中断服务程序） */
interrupt void SYS_PLL_SLIP_ISR(void)
{
    // Insert ISR Code here
    /* 在这里插入中断服务程序代码 */

    // To receive more interrupts from this PIE group,
    // acknowledge this interrupt.
    /* 要从此PIE组接收更多中断，确认此中断 */
    // PieCtrlRegs.PIEACK.all = PIEACK_GROUP12;

    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    /* 以下两行仅用于调试，在此处暂停处理器 */
    /* 插入中断服务程序代码后移除 */
    asm ("      ESTOP0");
    for(;;);
}

// 12.14 - Auxiliary PLL Slip Interrupt
/* 函数：AUX_PLL_SLIP_ISR（辅助PLL滑移中断服务程序） */
interrupt void AUX_PLL_SLIP_ISR(void)
{
    // Insert ISR Code here
    /* 在这里插入中断服务程序代码 */

    // To receive more interrupts from this PIE group,
    // acknowledge this interrupt.
    /* 要从此PIE组接收更多中断，确认此中断 */
    // PieCtrlRegs.PIEACK.all = PIEACK_GROUP12;

    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    /* 以下两行仅用于调试，在此处暂停处理器 */
    /* 插入中断服务程序代码后移除 */
    asm ("      ESTOP0");
    for(;;);
}

// 12.15 - CLA Overflow Interrupt
/* 函数：CLA_OVERFLOW_ISR（控制律加速器溢出中断服务程序） */
interrupt void CLA_OVERFLOW_ISR(void)
{
    // Insert ISR Code here
    /* 在这里插入中断服务程序代码 */

    // To receive more interrupts from this PIE group,
    // acknowledge this interrupt.
    /* 要从此PIE组接收更多中断，确认此中断 */
    // PieCtrlRegs.PIEACK.all = PIEACK_GROUP12;

    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    /* 以下两行仅用于调试，在此处暂停处理器 */
    /* 插入中断服务程序代码后移除 */
    asm ("      ESTOP0");
    for(;;);
}

// 12.16 - CLA Underflow Interrupt
/* 函数：CLA_UNDERFLOW_ISR（控制律加速器下溢中断服务程序） */
interrupt void CLA_UNDERFLOW_ISR(void)
{
    // Insert ISR Code here
    /* 在这里插入中断服务程序代码 */

    // To receive more interrupts from this PIE group,
    // acknowledge this interrupt.
    /* 要从此PIE组接收更多中断，确认此中断 */
    // PieCtrlRegs.PIEACK.all = PIEACK_GROUP12;

    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    /* 以下两行仅用于调试，在此处暂停处理器 */
    /* 插入中断服务程序代码后移除 */
    asm ("      ESTOP0");
    for(;;);
}

//---------------------------------------------------------------------------
// Catch-all Default ISRs:

// Reserved ISR
/* 函数：PIE_RESERVED_ISR（PIE保留中断服务程序） */
interrupt void PIE_RESERVED_ISR(void)
{
    asm ("      ESTOP0");
    for(;;);
}

// Only does a return
/* 函数：EMPTY_ISR（空中断服务程序） */
interrupt void EMPTY_ISR(void)
{

}

// Unused ISR
/* 函数：NOTUSED_ISR（未使用中断服务程序） */
interrupt void NOTUSED_ISR(void)
{
    asm ("      ESTOP0");
    for(;;);
}



